# data = ['별', 2, 'M', '서울특별시 강서구', 'Y']
# f"""이름: {data[0]}
# 나이: {data[1]}
# 성별: {data[2]}
# 지역: {data[3]}
# 중성화 여부: {data[4]}"""
# print(data)

# data1 = ['별', 2, 'M', '서울특별시 강서구', 'Y']
# """이름: {}
# 나이: {}
# 성별: {}
# 지역: {}
# 중성화 여부: {}"""
# print(data1)

# r = float(input("구의 반지름을 입력해주세요> "))
# pi = float(3.141592)
# a = 4 / 3 * pi * (r ** 3)
# b = 4 * pi * (r ** 2)
# print(a)
# print(b)

# a = float(input("밑변의 길이를 입력해주세요> "))
# b = float(input("높이의 길이를 입력해주세요> "))

# c = (a**2 + b**2)**(1/2)
# print(f"빗변의 길이는 {c}입니다.")